{"races": [








  { "name": "Dwarf",
    "names": {
        "male": ["Dolgrin", "Grunyar", "Harsk", "Kazmuk", "Morgrym", "Rogar" ],
        "female": ["Agna", "Bodill", "Ingra", "Kotri", "Rusilka", "Yangrit" ]
    },
    "age":{
       "adulthood": 40,
       "intuitive": "+3d6",
       "selftaught": "+5d6",
       "trained": "+7d6",
       "__comment": "intuitive classes include barbarians, oracles, rogues, and sorcerers, self taught classes include bards, cavaliers, fighters, gunslingers, paladins, rangers, summoners, and witches. Trained classes include alchemists, clerics, druids, inquisitors, magi, monks, and wizards."
    },
    "height":{
        "malebase": 45,
        "malemod": "+2d4",
        "femalebase": 43,
        "femalemod": "+2d4"
    },
    "weight":{
        "malebase": 150,
        "malemod": "+2d8*7",
        "femalebase": 120,
        "femalemod": "+2d8*7"
    },

    "ability":[{"con":2}, {"wis":2}, {"cha":-2}],
    "size": "Medium Humanoid (dwarf)",
    "speed": "20ft",
    "languages": ["Common", "Dwarven"],
    "intlanguages": [],
    "traits": [
        {
           "name":"Defensive Training",
           "desc":"Dwarves gain a +4 dodge bonus to AC against monsters of the giant subtype."
        },
        {
           "name":"Hardy",
           "desc":"Dwarves gain a +2 racial bonus on saving throws against poison, spells, and spell-like abilities."
        },
        {
           "name":"Stability",
           "desc":"Dwarves gain a +4 racial bonus to their Combat Maneuver Defense when resisting a bull rush or trip attempt while standing on the ground."
        },
        {
           "name":"Greed",
           "desc":"Dwarves gain a +2 racial bonus on Appraise checks made to determine the price of non-magical goods that contain precious metals or gemstones."
        },
        {
           "name":"Stonecunning",
           "desc":"Dwarves gain a +2 bonus on Perception checks to notice unusual stonework, such as traps and hidden doors located in stone walls or floors. They receive a check to notice such features whenever they pass within 10 feet of them, whether or not they are actively looking."
        },
        {
           "name":"Darkvision",
           "desc":"Dwarves can see perfectly in the dark up to 60 feet."
        },
        {
           "name":"Hatred",
           "desc":"Dwarves gain a +1 racial bonus on attack rolls against humanoid creatures of the orc and goblinoid subtypes because of their special training against these hated foes."
        },
        {
           "name":"Weapon Familiarity",
           "desc":"Dwarves are proficient with battleaxes, heavy picks, and warhammers, and treat any weapon with the word “dwarven” in its name as a martial weapon."
        }
    ],
    "alternatetraits": [
        {
           "name":"Ancient Enmity",
           "desc":"Dwarves have long been in conflict with elves, especially the hated drow. Dwarves with this racial trait receive a +1 racial bonus on attack rolls against humanoid creatures of the elf subtype. This racial trait replaces hatred."
        },
        {
           "name":"Craftsman",
           "desc":"Dwarves are known for their superior craftsmanship when it comes to metallurgy and stonework. Dwarves with this racial trait receive a +2 racial bonus on all Craft or Profession checks related to metal or stone. This racial trait replaces greed."
        },
        {
           "name":"Deep Warrior",
           "desc":"Dwarves with this racial trait grew up facing the abominations that live deep beneath the surface. They receive a +2 dodge bonus to AC against monsters of the aberration type and a +2 racial bonus on combat maneuver checks made to grapple such creatures (or to continue a grapple). This racial trait replaces defensive training."
        },
        {
           "name":"Giant Hunter",
           "desc":"Dwarves with this racial trait gain a +1 bonus on attack rolls against humanoids with the giant subtype. Furthermore, they gain a +2 bonus on Survival checks to find and follow tracks made by humanoids with the giant subtype. This racial trait replaces hatred."
        },
        {
           "name":"Lorekeeper",
           "desc":"Dwarves keep extensive records about their history and the world around them. Dwarves with this racial trait receive a +2 racial bonus on Knowledge (history) checks that pertain to dwarves or their enemies. They can make such skill checks untrained. This racial trait replaces greed."
        },
        {
           "name":"Magic Resistant",
           "desc":"Some of the older dwarven clans are particularly resistant to magic. Dwarves with this racial trait gain spell resistance equal to 5 + their character level. This resistance can be lowered for 1 round as a standard action. Dwarves with this racial trait take a –2 penalty on all concentration checks made in relation to arcane spells. This racial trait replaces hardy."
        },
        {
           "name":"Minesight",
           "desc":"Dwarves with this racial trait increase the range of their darkvision to 90 feet; however, they are automatically dazzled in bright light and take a –2 penalty on saving throws against effects with the light descriptor. This racial trait replaces darkvision."
        },
        {
           "name":"Mountaineer",
           "desc":"Mountain dwarves are skilled at climbing and navigating narrow ledges. Dwarves with this racial trait are immune to altitude sickness and do not lose their Dexterity bonus to AC when making Climb or Acrobatics checks to cross narrow or slippery surfaces. This racial trait replaces stability."
        },
        {
           "name":"Relentless",
           "desc":"Dwarves are skilled at pushing their way through a battlefield, tossing aside lesser foes with ease. Dwarves with this racial trait receive a +2 bonus on combat maneuver checks made to bull rush or overrun an opponent. This bonus only applies while both the dwarf and his opponent are standing on the ground. This racial trait replaces stability."
        },
        {
           "name":"Rock Stepper",
           "desc":"Dwarves with this racial trait can skillfully negotiate rocky terrain. They can ignore difficult terrain created by rubble, broken ground, or steep stairs when they take a 5-foot step. This racial trait replaces stonecunning."
        },
        {
           "name":"Saltbeard",
           "desc":"Dwarves occasionally found iron cities along rugged seacoasts, and natives of such cities gain a +2 bonus on Profession (sailor) and Survival checks while at sea. They gain a +1 racial bonus on attack rolls and a +2 dodge bonus to AC against creatures with the aquatic or water subtype. Their greed racial trait applies only to treasure found in or under the water, but applies to all such treasure regardless of whether or not it contains metal or gemstones. This racial trait replaces defensive training, hatred, and stonecunning."
        },
        {
           "name":"Sky Sentinel",
           "desc":"As creatures with a deep affinity for the ground, dwarves are wary of attacks from above. Enemies on higher ground gain no attack roll bonus against dwarves with this racial trait, and they gain a +1 racial bonus on attack rolls, a +2 dodge bonus to AC, and a +2 bonus on Perception checks against flying creatures. This racial trait replaces defensive training, hatred, and stonecunning."
        },
        {
           "name":"Stonesinger",
           "desc":"Some dwarves' affinity for the earth grants them greater powers. Dwarves with this racial trait are treated as one level higher when casting spells with the earth descriptor or using granted powers of the Earth domain, the bloodline powers of the earth elemental bloodline, and revelations of the oracle's stone mystery. This ability does not give them early access to level-based powers; it only affects the powers they could use without this ability. This racial trait replaces stonecunning."
        },
        {
           "name":"Stubborn",
           "desc":"Dwarves are renowned for their stubbornness. Dwarves with this racial trait receive a +2 racial bonus on Will saves to resist spells and spell-like abilities of the enchantment (charm) and enchantment (compulsion) schools. In addition, if they fail such a save, they receive another save 1 round later to prematurely end the effect (assuming it has a duration greater than 1 round). This second save is made at the same DC as the first. If the dwarf has a similar ability from another source (such as a rogue's slippery mind), he can only use one of these abilities per round, but he can try the other on the second round if the first reroll ability fails. This racial trait replaces hardy."
        },
        {
           "name":"Surface Survivalist",
           "desc":"Some dwarves have dwelt so long above ground they have lost their ability to see at night. However, their adaptation to extreme environments allows them to treat wind conditions (when determining whether or not they are checked or blown away) and either hot or cold climates (choose one) as one step less severe. This racial trait replaces darkvision."
        },
        {
           "name":"Xenophobic",
           "desc":"Isolationist dwarves despise non-dwarven humanoids. They speak only Dwarven and do not gain any bonus languages from possessing a high Intelligence score. In addition, they learn only one language per 2 ranks of Linguistics they possess. However, their untrusting nature gives them a +1 bonus against mind-affecting effects, except for fear affects. This racial trait replaces a dwarf's normal languages."
        },
        {
           "name":"Wyrmscourged",
           "desc":"Dwarves with this racial trait gain a +1 bonus on attack rolls and a +2 dodge bonus to AC and on saving throws against the extraordinary, supernatural, and spell-like abilities of dragons. They also gain a +2 racial bonus on Knowledge (arcana) checks to identify dragons and can make such checks untrained. This racial trait replaces defensive training, hatred, and stonecunning."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add +1/4 to the alchemist's natural armor bonus when using his mutagen."},
        {"Arcanist": "Add +1/4 to the arcanist's effective class level when determining the effects of the arcane barrier and arcane weapon arcanist exploits. Source Advanced Class Guide"},
        {"Barbarian": "Add +1 to the barbarian's total number of rage rounds per day."},
        {"Bard": "Reduce arcane spell failure chance for casting bard spells when wearing medium armor by +1%. Once the total reaches 10%, the bard also receives Medium Armor Proficiency, if he does not already possess it."},
        {"Bloodrager": "Increase the bloodrager's total number of bloodrage rounds per day by 1. Source Advanced Class Guide"},
        {"Brawler": "Reduce the hardness of any object made from clay, stone, or metal by 1 whenever the object is struck by the brawler's unarmed strike (minimum 0). Source Advanced Class Guide"},
        {"Cavalier": "Add +1/2 to the cavalier's bonus to damage against targets of his challenge."},
        {"Cleric": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power."},
        {"Druid": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds +1/2 to the number of uses per day of that domain power."},
        {"Fighter": "Add +1 to the Fighter's CMD when resisting a bull rush or trip."},
        {"Gunslinger": "Reduce the misfire chance for one type of firearm by 1/4. You cannot reduce the misfire chance of a firearm below 1."},
        {"Hunter": "Gain a +1/2 bonus on wild empathy checks the hunter makes to influence animals and magical beasts that live underground. Source Advanced Class Guide"},
        {"Inquisitor": "Add +1/2 to the inquisitor's level for the purpose of determining the effects of one type of judgment."},
        {"Investigator": "Gain a +1/4 bonus on Perception checks when underground and +1/2 bonus to the investigator's trap sense ability regarding stone traps. Source Advanced Class Guide"},
        {"Magus": "Select one known magus arcana usable only once per day. The magus adds +1/6 to the number of times it can be used per day. Once that magus arcana is usable twice per day, the magus must select a different magus arcana."},
        {"Monk": "Reduce the Hardness of any object made of clay, stone, or metal by 1 whenever the object is struck by the monk's unarmed strike (minimum of 0)."},
        {"Oracle": "Reduce the penalty for not being proficient with one weapon by 1. When the nonproficiency penalty for a weapon becomes 0 because of this ability, the oracle is treated as having the appropriate Martial or Exotic Weapon Proficiency feat with that weapon."},
        {"Paladin": "Add a +1 bonus on concentration checks when casting paladin spells."},
        {"Ranger": "Add a +1/2 bonus on wild empathy checks to influence animals and magical beasts that live underground."},
        {"Rogue": "Add a +1/2 bonus on Disable Device checks regarding stone traps and a +1/2 bonus to trap sense regarding stone traps."},
        {"Shaman": "Add +1/4 to the natural armor bonus of the shaman's spirit animal. Source Advanced Class Guide"},
        {"Skald": "Reduce the arcane spell failure chance for casting skald spells when wearing heavy armor by 1%. Once the total reduction reaches 10%, the skald also receives Heavy Armor Proficiency (if the skald does not already possess it). Source Advanced Class Guide"},
        {"Slayer": "Gain a +1/3 bonus on Knowledge (dungeoneering) checks and on Survival checks when underground. If the slayer has a +1 bonus on Knowledge (dungeoneering) checks from this ability, he is also considered trained in that skill. Source Advanced Class Guide"},
        {"Sorcerer": "Add +1/2 to acid and earth spell or spell-like ability damage."},
        {"Summoner": "Add a +1/4 natural armor bonus to the AC of the summoner's eidolon."},
        {"Swashbuckler": "Add +1/4 to the swashbuckler's effective class level to determine the extra damage she deals because of the precise strike deed when wielding a light pick or a heavy pick. If the swashbuckler has the Slashing Grace feat or another similar effect, she can treat the battleaxe or handaxe as a one-handed piercing melee weapon, and she gains this benefit when wielding the appropriate weapon for the feat as well. Source Advanced Class Guide"},
        {"Warpriest": "Add +1/3 to the number of times per day the warpriest can use blessings, but he can only use these additional uses on blessings that affect weapons or armor. Source Advanced Class Guide"},
        {"Witch": "Add +1/4 natural armor bonus to the AC of the witch's familiar."},
        {"Wizard": "Select one item creation feat known by the wizard. Whenever he crafts an item using that feat, the amount of progress he makes in an 8-hour period increases by 200 gp (50 gp if crafting while adventuring). This does not reduce the cost of the item; it just increases the rate at which the item is crafted."}

    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Breadth of Experience",
        "Brewmaster",
        "Cleave Through",
        "Cloven Helm",
        "Dented Helm",
        "Fight On",
        "Giant Killer",
        "Goblin Cleaver",
        "Hard-headed",
        "Improved Stonecunning",
        "Ironguts",
        "Ironhide",
        "Ledge Walker",
        "Let Them Come",
        "Orc Hewer",
        "Shatterspell",
        "Steel Soul",
        "Stone-Faced",
        "Stone Singer",
        "Toxic Recovery",
        "Twin Thunders"
    ],
    "racialprestigeclasses": []
  },





























  { "name": "Elf",
    "names": {
        "male": ["Caladrel", "Heldalel", "Lanliss", "Meirdrarel", "Seldlon", "Talathel", "Variel", "Zordlon" ],
        "female": ["Amrunelara", "Dardlara", "Faunra", "Jathal", "Merisiel", "Oparal", "Soumral", "Tessara", "Yalandlara" ]
    },
    "age":{
       "adulthood": 110,
       "intuitive": "+4d6",
       "selftaught": "+6d6",
       "trained": "+10d6"
    },
    "height":{
        "malebase": 64,
        "malemod": "+2d8",
        "femalebase": 64,
        "femalemod": "+2d8"
    },
    "weight":{
        "malebase": 110,
        "malemod": "+2d8*3",
        "femalebase": 90,
        "femalemod": "+2d6*3"
    },

    "ability":[{"dex":2}, {"int":2}, {"con":-2}],
    "size": "Medium Humanoid (elf)",
    "speed": "30ft",
    "languages": ["Common", "Elven"],
    "intlanguages" : ["Celestial", "Draconic", "Gnoll", "Gnome", "Goblin", "Orc", "Sylvan"],
    "traits": [
        {
           "name":"Elven Immunities",
           "desc":"Elves are immune to magic sleep effects and gain a +2 racial saving throw bonus against enchantment spells and effects."
        },
        {
           "name":"Keen Senses",
           "desc":"Elves receive a +2 racial bonus on Perception checks."
        },
        {
           "name":"Elven Magic",
           "desc":"Elves receive a +2 racial bonus on caster level checks made to overcome spell resistance. In addition, elves receive a +2 racial bonus on Spellcraft skill checks made to identify the properties of magic items."
        },
        {
           "name":"Weapon Familiarity",
           "desc":"Elves are proficient with longbows (including composite longbows), longswords, rapiers, and shortbows (including composite shortbows), and treat any weapon with the word “elven” in its name as a martial weapon."
        },
        {
           "name":"Low-Light Vision",
           "desc":"Elves can see twice as far as humans in conditions of dim light."
        }
    ],
    "alternatetraits": [
        {
           "name":"Arcane Focus",
           "desc":"Some elven families have such long traditions of producing wizards (and other arcane spellcasters) that they raise their children with the assumption each is destined to be a powerful magic-user, with little need for mundane concerns such as skill with weapons. Elves with this racial trait gain a +2 racial bonus on concentration checks made to cast arcane spells defensively. This racial trait replaces weapon familiarity."
        },
        {
           "name":"Darkvision",
           "desc":"Though uncommon, some groups of elves are born with darkvision, rather than low-light vision. In many cases this is taken as a sign of a drow in the elf's ancestry, and can lead to persecution within the elf's home community. Elves with this racial trait gain darkvision with a range of 60 feet, but also gain sensitivity to light and are dazzled in areas of bright light or within the radius of a daylight spell. This racial trait replaces low-light vision."
        },
        {
           "name":"Desert Runner",
           "desc":"Some elves thrive in the deepest deserts, forever roaming across burned and parched lands. Elves with this racial trait receive a +4 racial bonus on Constitution checks and Fortitude saves to avoid fatigue, exhaustion, or ill effects from running, forced marches, starvation, thirst, or hot or cold environments. This racial trait replaces elven magic."
        },
        {
           "name":"Dreamspeaker",
           "desc":"A few elves have the ability to tap into the power of sleep, dreams, and prescient reverie. Elves with this racial trait add +1 to the saving throw DCs of spells of the divination school and sleep effects they cast. In addition, elves with Charisma scores of 15 or higher may use dream once per day as a spell-like ability (caster level is equal to the elf's character level). This racial trait replaces elven immunities."
        },
        {
           "name":"Elemental Resistance",
           "desc":"Elves who dwell in the most extreme environments, from arctic wastelands to volcanic plains, develop natural resistance to the dangers of their homelands over the course of a few generations. Elves with this racial trait gain elemental resistance 5 to acid, cold, electricity, or fire. This choice is made at character creation, and once made it cannot be changed. This racial trait replaces elven immunities."
        },
        {
           "name":"Envoy",
           "desc":"Elves often have trouble relating to neighbors of other races, especially those with much shorter lifespans. As a result, some are trained in minor magics that are particularly useful when dealing with non-elves. Elves with this racial trait and an Intelligence score of 11 or higher gain the following spell-like abilities once per day: comprehend languages, detect magic, detect poison, and read magic. The caster level for these effects is equal to the elf's level. This racial trait replaces elven magic."
        },
        {
           "name":"Eternal Grudge",
           "desc":"Some elves grow up in secluded, isolationist communities where generations-old slights and quarrels linger as eternal blood feuds. Elves with this racial trait receive a +1 bonus on attack rolls against humanoids of the dwarf and orc subtypes because of special training against these hated foes. This racial trait replaces elven magic."
        },
        {
           "name":"Fleet-Footed",
           "desc":"While all elves are naturally lithe and agile, some also are naturally speedy and have a strong desire to rush into situations rather than worrying about looking ahead. Elves with this racial trait receive Run as a bonus feat and a +2 racial bonus on initiative checks. This racial trait replaces keen senses and weapon familiarity."
        },
        {
           "name":"Lightbringer",
           "desc":"Many elves revere the sun, moon, and stars, but some are literally infused with the radiant power of the heavens. Elves with this racial trait are immune to light-based blindness and dazzle effects, and are treated as one level higher when determining the effects of any light-based spell or effect they cast (including spell-like and supernatural abilities). Elves with Intelligence scores of 10 or higher may use light at will as a spell-like ability. This racial trait replaces the elven immunities and elven magic racial traits."
        },
        {
           "name":"Silent Hunter",
           "desc":"Elves are renowned for their subtlety and skill. Elves with this racial trait reduce the penalty for using Stealth while moving by 5 and can make Stealth checks while running at a –20 penalty (this number includes the penalty reduction from this racial trait). This racial trait replaces elven magic."
        },
        {
           "name":"Spirit of the Waters",
           "desc":"Some elves have adapted to life in tune with the sea or along the reedy depths of wild rivers and lakes. They gain a +4 racial bonus on Swim checks, can always take 10 while swimming, and may choose Aquan as a bonus language. They are proficient with longspear, trident, and net. This racial trait replaces elven magic and weapon familiarity."
        },
        {
           "name":"Urbanite",
           "desc":"Elves who live in cities for more than a century can grow to know the ebb and flow of social situations just as their forest-dwelling cousins know the rules of the wild. Elves with this racial trait gain a +2 racial bonus on Diplomacy checks made to gather information and Sense Motive checks made to get a hunch about a social situation. This racial trait replaces keen senses."
        },
        {
           "name":"Woodcraft",
           "desc":"Elves know the deep secrets of the wild like no others, especially secrets of the forests. Elves with this racial trait gain a +1 racial bonus on Knowledge (nature) and Survival checks. In forest terrain, these bonuses improve to +2. This racial trait replaces elven magic."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add one extract formula from the alchemist's list to his formula book. This formula must be at least one level lower than the highest-level formula the alchemist can create."},
        {"Arcanist": "Increase total number of points in the arcanist's arcane reservoir by 1."},
        {"Barbarian": "Add +1 to the barbarian's base speed. In combat this option has no effect unless the barbarian has selected it five times (or another increment of five). This bonus stacks with the barbarian's fast movement feature and applies under the same conditions as that feature."},
        {"Bard": "Add +1 to the bard's CMD when resisting a disarm or sunder attempt."},
        {"Bloodrager": "Add 1 foot to the bloodrager's base speed. In combat, this only has an effect for every five increases in base speed. This bonus stacks with the bloodrager's fast movement class feature, and applies under the same conditions and that feature."},
        {"Brawler": "Add 1 foot to the brawler's base speed. In combat, this has an effect only for every five increases in the brawler's base speed."},
        {"Cavalier": "Add +1 hit point to the cavalier's mount. If the cavalier ever replaces his mount, the new mount gains these bonus hit points."},
        {"Cleric": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power."},
        {"Druid": "Add +1/3 to the druid's natural armor bonus when using wild shape."},
        {"Fighter": "Add +1 to the Fighter's CMD when resisting a disarm or sunder attempt."},
        {"Gunslinger": "Add +1/3 on critical hit confirmation rolls made with firearms (maximum bonus of +5). This bonus does not stack with Critical Focus."},
        {"Hunter": "Choose a weapon from the following list: longbow, longsword, rapier, short sword, shortbow, or any weapon with 'elven' in its name. Gain a +1/2 bonus on critical hit confirmation rolls made while using that type of weapon (maximum bonus +4). This bonus does not stack with those gained through Critical Focus and similar effects."},
        {"Inquisitor": "Add one spell known from the inquisitor's spell list. This spell must be at least one level below the highest-level spell the inquisitor can cast."},
        {"Investigator": "Increase the total number of points in the investigator's inspiration pool by 1/3."},
        {"Magus": "The magus gains 1/6 of a new magus arcana."},
        {"Monk": "Add +1 to the monk's base speed. In combat this option has no effect unless the monk has selected it five times (or another increment of five). This bonus stacks with the monk's fast movement class feature and applies under the same conditions as that feature."},
        {"Oracle": "Add +1/2 to the oracle's level for the purpose of determining the effects of one revelation."},
        {"Paladin": "Add +1/2 hit point to the paladin's lay on hands ability (whether using it to heal or harm)."},
        {"Ranger": "Choose a weapon from the following list: longbow, longsword, rapier, shortbow, short sword, or any weapon with “elven” in its name. Add +1/2 on critical hit confirmation rolls made while using that weapon (maximum bonus of +4). This bonus does not stack with Critical Focus."},
        {"Rogue": "Add +1 to the number of times per day the rogue can cast a cantrip or 1st-level spell gained from the minor magic or major magic talent. The number of times this bonus is selected for the major magic talent cannot exceed the number of times it is selected for the minor magic talent. The rogue must possess the associated rogue talent to select these options."},
        {"Shaman": "Add 5 feet to the range of a chosen shaman hex. Multiple bonuses from this ability can apply to the same hex, to a maximum of an additional 30 feet for any single hex."},
        {"Skald": "Increase the bonus granted by the well-versed class feature by 1/4 (maximum +8)."},
        {"Slayer": "Increase the studied target bonus on Perception and Survival checks by 1/4. When the slayer gains the stalker class feature, he also gains this increase to the studied target bonus on Stealth checks."},
        {"Sorcerer": "Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power."},
        {"Summoner": "The amount of time the summoner must spend to summon his eidolon is reduced by 1 round, to a minimum of 1 round."},
        {"Swashbuckler": "Increase the total number of points in the swashbuckler's panache pool by 1/4."},
        {"Warpriest": "Add 1/2 to the number of times per day the warpriest can use blessings, but he can use these additional blessings on only those from the Air, Animal, Charm, Magic, Plant, or Sun domains."},
        {"Witch": "Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level lower than the highest-level spell she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells."},
        {"Wizard": "Select one arcane school power at 1st level that is normally usable a number of times per day equal to 3 + the wizard's Intelligence modifier. The wizard adds +1/2 to the number of uses per day of that arcane school power."}

    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Attuned to the Wild",
        "Breadth of Experience",
        "Elven Accuracy",
        "Elven Battle Training",
        "Guardian of the Wild",
        "Leaf Singer",
        "Light Step",
        "Mage of the Wild",
        "Spirit of the Wild",
        "Stabbing Shot"
    ],
    "racialprestigeclasses": ["Brightness Seeker"]
  },



























  { "name": "Gnome",
    "names": {
        "male": ["Abroshtor", "Bastargre", "Halungalom", "Krolmnite", "Poshment", "Zarzuket", "Zatqualmie" ],
        "female": ["Besh", "Fijit", "Lini", "Majet", "Neji", "Pai", "Queck", "Trig" ]
    },
    "age":{
       "adulthood": 40,
       "intuitive": "+4d6",
       "selftaught": "+6d6",
       "trained": "+9d6"
    },
    "height":{
        "malebase": 36,
        "malemod": "+2d4",
        "femalebase": 34,
        "femalemod": "+2d4"
    },
    "weight":{
        "malebase": 35,
        "malemod": "+2d4",
        "femalebase": 30,
        "femalemod": "+2d4"
    },

    "ability":[{"con":2}, {"cha":2}, {"str":-2}],
    "size": "Small Humanoid (gnome)",
    "speed": "20ft",
    "languages": ["Common", "Gnome", "Sylvan"],
    "intlanguages" : ["Draconic", "Dwarven", "Elven", "Giant", "Goblin", "Orc"],
    "traits": [
        {
           "name":"Defensive Training",
           "desc":"Gnomes gain a +4 dodge bonus to AC against monsters of the giant subtype."
        },
        {
           "name":"Illusion Resistance",
           "desc":"Gnomes gain a +2 racial saving throw bonus against illusion spells and effects."
        },
        {
           "name":"Keen Senses",
           "desc":"Gnomes receive a +2 racial bonus on Perception checks."
        },
        {
           "name":"Obsessive",
           "desc":"Gnomes receive a +2 racial bonus on a Craft or Profession skill of their choice."
        },
        {
           "name":"Gnome Magic",
           "desc":"Gnomes add +1 to the DC of any saving throws against illusion spells that they cast. Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—dancing lights, ghost sound, prestidigitation, and speak with animals. The caster level for these effects is equal to the gnome's level. The DC for these spells is equal to 10 + the spell's level + the gnome's Charisma modifier."
        },
        {
           "name":"Hatred",
           "desc":"Gnomes receive a +1 bonus on attack rolls against humanoid creatures of the reptilian and goblinoid subtypes because of their special training against these hated foes."
        },
        {
           "name":"Weapon Familiarity",
           "desc":"Gnomes treat any weapon with the word “gnome” in its name as a martial weapon."
        },
        {
           "name":"Low-Light Vision",
           "desc":"Gnomes can see twice as far as humans in conditions of dim light."
        }
    ],
    "alternatetraits": [
        {
           "name":"Academician",
           "desc":"Some gnomes are more academically inclined than their kin. Gnomes with this racial trait gain a +2 bonus on any single Knowledge skill. This racial trait replaces the obsessive racial trait."
        },
        {
           "name":"Bond to the Land",
           "desc":"Some gnomes have strong ties to specific kinds of terrain, as a holdover from their fey origins. These gnomes gain a +2 dodge bonus to AC when in a specific terrain type selected from the ranger list of favored terrains. This choice is made at character creation, and cannot be changed. This racial trait replaces defensive training and hatred."
        },
        {
           "name":"Darkvision",
           "desc":"Some gnome strains have lived in the underground depths for so long they have given up on light entirely and gained darkvision with a range of 60 feet. This racial trait replaces low-light vision and keen senses."
        },
        {
           "name":"Eternal Hope",
           "desc":"Gnomes rarely lose hope and are always confident that even hopeless situations will work out. Gnomes with this racial trait receive a +2 racial bonus on saving throws against fear and despair effects. Once per day, after rolling a 1 on a d20, the gnome may reroll and use the second result. This racial trait replaces defensive training and hatred."
        },
        {
           "name":"Explorer",
           "desc":"Many gnomes are obsessed with seeing as much of the world as possible, rather than perfecting some specific talent or vocation. These gnomes gain a +2 racial bonus on Climb checks and checks for one Knowledge skill of their choice. This racial trait replaces hatred and obsessive."
        },
        {
           "name":"Fell Magic",
           "desc":"Gnomes add +1 to the DC of any saving throws against necromancy spells that they cast. Gnomes with Wisdom scores of 11 or higher also gain the following spell-like abilities: 1/day—bleed, chill touch, detect poison, and touch of fatigue. The caster level for these effects is equal to the gnome's level. The DC for these spells is equal to 10 + the spell's level + the gnome's Wisdom modifier. This racial trait replaces gnome magic."
        },
        {
           "name":"Gift of Tongues",
           "desc":"Gnomes love languages and learning about those they meet. Gnomes with this racial trait gain a +1 bonus on Bluff and Diplomacy checks, and they learn one additional language every time they put a rank in the Linguistics skill. This racial trait replaces defensive training and hatred."
        },
        {
           "name":"Knack with Poison",
           "desc":"ome gnomes have an instinctive understanding of poisons and their uses. Gnomes gain a +2 racial bonus on Fortitude saves against poison and a +2 bonus on Craft (alchemy) checks to make poison. The bonus on Fortitude saving throws against poisons increases to +4 if the gnome accidentally poisons himself when applying or readying the substance. This racial trait replaces illusion resistance and obsessive."
        },
        {
           "name":"Magical Linguist",
           "desc":"Gnomes study languages in both their mundane and supernatural manifestations. Gnomes with this racial trait add +1 to the DC of spells they cast with the language-dependent descriptor or those that create glyphs, symbols, or other magical writings. They gain a +2 racial bonus on saving throws against such spells. Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—arcane mark, comprehend languages, message, read magic. The caster level for these effects is equal to the gnome's level. This racial trait replaces gnome magic and illusion resistance."
        },
        {
           "name":"Master Tinker",
           "desc":"Gnomes experiment with all manner of mechanical devices. Gnomes with this racial trait gain a +1 bonus on Disable Device and Knowledge (engineering) checks. They are treated as proficient with any weapon they have personally crafted. This racial trait replaces defensive training and hatred."
        },
        {
           "name":"Pyromaniac Gnomes",
           "desc":"with this racial trait are treated as one level higher when casting spells with the fire descriptor, using granted powers of the Fire domain, using the bloodline powers of the fire elemental bloodline or the revelations of the oracle's flame mystery, and determining the damage of alchemist bombs that deal fire damage (this ability does not give gnomes early access to level-based powers; it only affects the powers they could use without this ability). Gnomes with Charisma scores of 11 or higher also gain the following spell-like abilities: 1/day—dancing lights, flare, prestidigitation, produce flame. The caster level for these effects is equal to the gnome's level; the DCs are Charisma-based. This racial trait replaces gnome magic and illusion resistance."
        },
        {
           "name":"Warden of Nature",
           "desc":"Gnomes must often protect their homes against unnatural or pestilential infestations. Gnomes with this racial trait gain a +2 dodge bonus to AC against aberrations, oozes, and vermin, and a +1 bonus on attack rolls against them because of their special training. This racial trait replaces defensive training and hatred."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add +1/2 to the number of bombs per day the alchemist can create."},
        {"Arcanist": "Add 1/6 to the number of points the arcanist gains in her arcane reservoir each day."},
        {"Barbarian": "Add a +1/2 bonus to the barbarian's trap sense."},
        {"Bard": "Add +1 to the bard's total number of bardic performance rounds per day."},
        {"Bloodrager": "Add 1/4 to the bloodrager's effective class level when determining the power of her bloodrager bloodline powers."},
        {"Brawler": "Increase the number of times per day the brawler can use martial flexibility by 1/4."},
        {"Cavalier": "Add +1 to the cavalier's mounted base speed. In combat this has no effect unless the cavalier has selected this reward five times (or another increment of five). If the cavalier ever replaces his mount, the new mount gains this bonus to its speed."},
        {"Cleric": "Add +1/2 to the cleric's channeled energy total when healing creatures of the animal, fey, and plant types."},
        {"Druid": "The druid gains energy resistance 1 against acid, cold, electricity, or fire. Each time the druid selects this reward, increase her resistance to one of these energy types by +1 (maximum 10 for any one type)."},
        {"Fighter": "Add +1 to the fighter's CMD when resisting a dirty trick or steal attempt."},
        {"Gunslinger": "The gunslinger reduces the amount of time needed to restore a broken firearm using the Gunsmithing feat by 5 minutes (maximum reduction of 50 minutes)."},
        {"Hunter": "Add DR 1/magic to the hunter's animal companion. Each time the hunter gains another level, the DR increases by 1/2 (maximum DR 10/magic). If the hunter replaces her animal companion, the new companion gains this damage reduction."},
        {"Inquisitor": "Add a +1 bonus on concentration checks when casting inquisitor spells."},
        {"Investigator": "Add one extract formula from the investigator's list to his formula book. This formula must be at least 1 formula level below the highest level the investigator can create."},
        {"Magus": "Add one of the following weapon special abilities to the list of weapon special abilities the magus may add to his weapon using his arcane pool: defending, ghost touch, merciful, mighty cleaving, vicious; allying, conductive, corrosive, corrosive burst, menacing. Once an ability has been selected with this reward, it cannot be changed."},
        {"Monk": "Add +1 to the monk's Acrobatics check bonus gained by spending a point from his ki pool. A monk must be at least 5th level to select this benefit."},
        {"Oracle": "Add +1/2 to the oracle's level for the purpose of determining the effects of the oracle's curse ability."},
        {"Paladin": "Add +1/2 hit point to the paladin's lay on hands ability (whether using it to heal or harm)."},
        {"Ranger": "Add DR 1/magic to the ranger's animal companion. Each additional time the ranger selects this benefit, the DR/magic increases by +1/2 (maximum DR 10/magic). If the ranger ever replaces his animal companion, the new companion gains this DR."},
        {"Rogue": "The rogue gains a +1/2 bonus on Disable Device and Use Magic Device checks related to glyphs, symbols, scrolls, and other magical writings."},
        {"Shaman": "The shaman gains 1/6 of a new shaman hex."},
        {"Skald": "Add a +1 bonus on concentration checks when casting skald spells."},
        {"Slayer": "The slayer gains 1/6 of a new slayer talent."},
        {"Sorcerer": "Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power."},
        {"Summoner": "Add +1 hit point to the summoner's eidolon."},
        {"Swashbuckler": "Increase the number of times per day the swashbuckler can use charmed life by 1/4."},
        {"Warpriest": "Add 1/2 to the result of the warpriest's channeled energy when healing creatures of the animal, fey, and plant types."},
        {"Witch": "The witch gains 1/6 of a new witch hex."},
        {"Wizard": "Select one arcane school power at 1st level that is normally usable a number of times per day equal to 3 + the wizard's Intelligence modifier. The wizard adds +1/2 to the number of uses per day of that arcane school power."}

    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Arcane School Spirit",
        "Arcane Talent",
        "Bewildering Koan",
        "Breadth of Experience",
        "Casual Illusionist",
        "Effortless Trickery",
        "Extra Gnome Magic",
        "Expanded Resistance",
        "Gnome Trickster",
        "Gnome Weapon Focus",
        "Great Hatred",
        "Groundling",
        "Tantrum",
        "Vast Hatred"
    ],
    "racialprestigeclasses": []
  },




























  { "name": "Half-Elf",
    "names": {
        "male": ["Calathes", "Encinal", "Iradli", "Kyras", "Narciso", "Quinray", "Seltyiel", "Zirul" ],
        "female": ["Cathran", "Elsbeth", "Iandoli", "Kieyanna", "Lialda", "Maddela", "Reda", "Tamarie" ]
    },
    "age":{
       "adulthood": 20,
       "intuitive": "+1d6",
       "selftaught": "+2d6",
       "trained": "+3d6"
    },
    "height":{
        "malebase": 62,
        "malemod": "+2d8",
        "femalebase": 60,
        "femalemod": "+2d8"
    },
    "weight":{
        "malebase": 100,
        "malemod": "+2d8*5",
        "femalebase": 90,
        "femalemod": "+2d8*5"
    },

    "ability":[{"any":2}],
    "size": "Medium Humanoid (human, elf)",
    "speed": "30ft",
    "languages": ["Common", "Elven"],
    "intlanguages" : ["any"],
    "traits": [
        {
           "name":"Elven Immunities",
           "desc":"Half-elves are immune to magic sleep effects and gain a +2 racial saving throw bonus against enchantment spells and effects."
        },
        {
           "name":"Adaptability",
           "desc":"Half-elves receive Skill Focus as a bonus feat at 1st level."
        },
        {
           "name":"Keen Senses",
           "desc":"Half-elves receive a +2 racial bonus on Perception checks."
        },
        {
           "name":"Low-Light Vision",
           "desc":"Half-elves can see twice as far as humans in conditions of dim light."
        },
        {
           "name":"Elf Blood",
           "desc":"Half-elves count as both elves and humans for any effect related to race."
        },
        {
           "name":"Multitalented",
           "desc":"Half-elves choose two favored classes at first level and gain +1 hit point or +1 skill point whenever they take a level in either one of those classes."
        }
    ],
    "alternatetraits": [
        {
           "name":"Ancestral Arms",
           "desc":"Some half-elves receive training in an unusual weapon. Half-elves with this racial trait receive Exotic Weapon Proficiency or Martial Weapon Proficiency with one weapon as a bonus feat at 1st level. This racial trait replaces the adaptability racial trait."
        },
        {
           "name":"Arcane Training",
           "desc":"Half-elves occasionally seek tutoring to help them master the magic in their blood. Half-elves with this racial trait have only one favored class, and it must be an arcane spellcasting class. They can use spell trigger and spell completion items for their favored class as if one level higher (or as a 1st-level character if they have no levels in that class). This racial trait replaces the multitalented racial trait."
        },
        {
           "name":"Child of the Sea",
           "desc":"(from Coastal Regions) [BOG] Half-Elves from a coastal region with this racial trait gain a +4 racial bonus on Swim checks as well as on Profession (sailor) and Wisdom checks to pilot a sea vessel. They also have an innate sense of direction and can never get lost at sea. This racial trait replaces the low-light vision and keen senses racial traits."
        },
        {
           "name":"Cold-Honed",
           "desc":"(from Arctic Region) [BOG] Half-Elves from arctic regions with this racial trait can move through natural snow and ice at their normal speed and gain a +4 racial bonus on Fortitude saves to avoid nonlethal damage from cold environments. This racial trait replaces the elven immunities racial trait."
        },
        {
           "name":"Drow-Blooded",
           "desc":"Some half-elves born of drow parents exhibit more drow traits than others—particularly many of the physical features of the drow—and have darkvision 60 feet and light blindness. This racial trait replaces the low-light vision racial trait."
        },
        {
           "name":"Drow Magic",
           "desc":"A few half-elves with drow ancestry exhibit the innate magic of that race. Half-elves with this trait have drow blood somewhere in their background, and can cast dancing lights, darkness, and faerie fire each once per day, using the half-elf's character level as the caster level for these spell-like abilities. This racial trait replaces the adaptability and multitalented racial traits."
        },
        {
           "name":"Dual Minded",
           "desc":"The mixed ancestry of some half-elves makes them resistant to mental attacks. Half-elves with this racial trait gain a +2 bonus on all Will saving throws. This racial trait replaces the adaptability racial trait."
        },
        {
           "name":"Integrated",
           "desc":"Many half-elves are skilled in the art of ingratiating themselves into a community as if they were natives. Half-elves with this racial trait gain a +1 bonus on Bluff, Disguise, and Knowledge (local) checks. This racial trait replaces the adaptability racial trait."
        },
        {
           "name":"Jungle Affinity",
           "desc":"(from a Jungle) [BOG] Half-Elves from a jungle with this racial trait gain a +4 racial bonus on Stealth checks while within jungle terrain, and can move through natural difficult terrain at their normal speed while within jungle. This racial trait replaces the multi-talented racial trait."
        },
        {
           "name":"Mordant Envoy",
           "desc":"(from Mountainous Terrain) [BOG] Half-Elves from mountainous regions add +1 to the caster level of any transmutation spells they cast. Spireborn with a Charisma score of 11 or higher also gain the following spell-like abilities: 1/day—comprehend languages, detect secret doors, erase, read magic. The caster level for these effects is equal to the user's character level. This racial trait replaces the adaptability racial trait."
        },
        {
           "name":"Sociable",
           "desc":"Half-elves are skilled at charming others and recovering from faux pas. If half-elves with this racial trait attempt to change a creature's attitude with a Diplomacy check and fail by 5 or more, they can try to influence the creature a second time even if 24 hours have not passed. This racial trait replaces the adaptability racial trait."
        },
        {
           "name":"Thinblood Resilience",
           "desc":"(from the Underdark) [BOG] Half-Elves from the underdark with this racial trait are accustomed to torture at the hands of their drow forebears, and gain a +2 racial bonus on Fortitude saves against poison and disease, including magical diseases. Darkborn also gain the poison use ability and never risk accidentally poisoning themselves. This racial trait replaces the elven immunities racial trait."
        },
        {
           "name":"Wary",
           "desc":"Many half-elves have spent their long lives moving from place to place, often driven out by the hostility of others. Such experiences have made them wary of others' motivations. Half-elves with this trait gain a +1 racial bonus on Sense Motive and Bluff checks. This racial trait replaces the keen senses racial trait."
        },
        {
           "name":"Water Child",
           "desc":"Some half-elves are born of elves adapted to life on or near the water. These half-elves gain a +4 racial bonus on Swim checks, can always take 10 while swimming, and may choose Aquan as a bonus language. This racial trait replaces the adaptability and multitalented racial traits."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add +1 foot to the range increment of the alchemist's thrown splash weapons (including the alchemist's bombs). This option has no effect unless the alchemist has selected it 5 times (or another increment of 5); a range increment of 24 feet is effectively the same as a range increment of 20 feet, for example."},
        {"Arcanist": "When casting arcanist enchantment spells, add 1/3 to the effective caster level, but only for the purpose of determining duration."},
        {"Barbarian": "Add +1/4 to the bonus on Reflex saves and dodge bonus to AC against attacks made by traps granted by trap sense."},
        {"Bard": "Add +1 to the bard's total number of bardic performance rounds per day."},
        {"Bloodrager": "Increase the bonus gained from blood sanctuary by 1/4."},
        {"Brawler": "Add 1 to the brawler's CMD when she's resisting a trip or overrun combat maneuver."},
        {"Cavalier": "Add +1 foot to the cavalier's mount's base speed. This option has no effect unless the cavalier has selected it 5 times (or another increment of 5); a speed of 54 feet is effectively a speed of 50 feet, for example. If the cavalier ever replaces his mount, the new companion gains this base speed bonus."},
        {"Cleric": "Add +1/3 to the amount of damage dealt or damage healed when the cleric uses channel energy."},
        {"Druid": "Select one cleric domain power at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds +1/2 to the number of uses per day of that domain power. For druids whose nature bond gives them an animal companion, add +1 skill rank to the animal companion. If the druid ever replaces her animal companion, the new companion gains these bonus skill ranks."},
        {"Fighter": "Add +1 to the fighter's CMD when resisting a disarm or overrun combat maneuver."},
        {"Gunslinger": "Add +1/4 to the number of grit points in the gunslinger's grit pool."},
        {"Hunter": "Add 1 foot to the hunter's companion's base speed. In combat, this has an effect only for every five increases in base speed."},
        {"Inquisitor": "Add +1/4 to the number of times per day the inquisitor can change her most recent teamwork feat."},
        {"Investigator": "Gain a +1/4 bonus on all inspiration rolls."},
        {"Magus": "Add +1/4 to the magus's arcane pool."},
        {"Monk": "Add +1/2 on Escape Artist checks and on Acrobatics checks to cross narrow surfaces."},
        {"Oracle": "Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast."},
        {"Paladin": "Add +1 foot to the size of all the paladin's aura class features. This option has no effect unless the paladin has selected it 5 times (or another increment of 5); an aura of 14 feet is effectively the same as a 10-foot aura, for example."},
        {"Ranger": "Add +1 skill rank to the ranger's animal companion. If the ranger ever replaces his companion, the new companion gains these bonus skill ranks."},
        {"Rogue": "Add a +1/2 bonus on Bluff checks to feint and Diplomacy checks to gather information."},
        {"Shaman": "Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast."},
        {"Skald": "Increase the skald's total number of raging song rounds per day by 1."},
        {"Slayer": "Gain a +1/2 bonus on Bluff checks to feint and Diplomacy checks to gain information."},
        {"Sorcerer": "Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power."},
        {"Summoner": "Add +1/4 to the eidolon's evolution pool."},
        {"Swashbuckler": "Increase the number of times per day the swashbuckler can use charmed life by 1/4."},
        {"Warpriest": "Gain a +1/3 bonus on the damage dealt or healed with the warpriest's channel energy ability."},
        {"Witch": "Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells."},
        {"Wizard": "When casting wizard enchantment spells, add +1/3 to the effective caster level of the spell, but only to determine the spell's duration."}
    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Arcane Talent",
        "Discerning Eye",
        "Elven Spirit",
        "Exile's Path",
        "Half-Drow Paragon",
        "Human Spirit",
        "Leaf Singer",
        "Multitalented Mastery",
        "Neither Elf Nor Human",
        "Pass for Human",
        "Seen and Unseen",
        "Shared Insight",
        "Shared Manipulation",
        "Sociable"
    ],
    "racialprestigeclasses": []
  },























  { "name": "Halfling",
    "names": {
        "male": ["Antal", "Boram", "Hyrgan", "Jamir", "Lem", "Miro", "Sumak", "Tribin", "Uldar", "Vraxim" ],
        "female": ["Anafa", "Bellis", "Etune", "Filiu", "Irlana", "Marra", "Pressi", "Rilka", "Sistra", "Wyssal", "Yamyra" ]
    },
    "age":{
       "adulthood": 20,
       "intuitive": "+2d4",
       "selftaught": "+3d6",
       "trained": "+4d6"
    },
    "height":{
        "malebase": 32,
        "malemod": "+2d4",
        "femalebase": 30,
        "femalemod": "+2d4"
    },
    "weight":{
        "malebase": 30,
        "malemod": "+2d4",
        "femalebase": 25,
        "femalemod": "+2d4"
    },

    "ability":[{"dex":2}, {"cha":2}, {"str":-2}],
    "size": "Small Humanoid (halfling)",
    "speed": "20ft",
    "languages": ["Common", "Halfling"],
    "intlanguages": ["Dwarven", "Elven", "Gnome", "Goblin"],
    "traits": [
        {
           "name":"Fearless",
           "desc":"Halflings receive a +2 racial bonus on all saving throws against fear. This bonus stacks with the bonus granted by halfling luck."
        },
        {
           "name":"Halfling Luck",
           "desc":"Halflings receive a +1 racial bonus on all saving throws."
        },
        {
           "name":"Sure-Footed",
           "desc":"Halflings receive a +2 racial bonus on Acrobatics and Climb checks."
        },
        {
           "name":"Weapon Familiarity",
           "desc":"Halflings are proficient with slings and treat any weapon with the word “halfling” in its name as a martial weapon."
        },
        {
           "name":"Keen Senses",
           "desc":"Halflings receive a +2 racial bonus on Perception checks."
        }
    ],
    "alternatetraits": [
        {
           "name":"Adaptable Luck",
           "desc":"Some halflings have greater control over their innate luck. This ability gives them more options for how they can apply their good fortune from day to day, but also narrows its scope. Three times per day, a halfling can gain a +2 luck bonus on an ability check, attack roll, saving throw, or skill check. If halflings choose to use the ability before they make the roll or check, they gain the full +2 bonus; if they choose to do so afterward, they only gain a +1 bonus. Using adaptive luck in this way is not an action. This racial trait replaces halfling luck."
        },
        {
           "name":"Craven",
           "desc":"While most halflings are fearless, some are skittish, making them particularly alert. Halflings with this racial trait gain a +1 bonus on initiative checks and a +1 bonus on attack rolls when flanking. They take a –2 penalty on saves against fear effects and gain no benefit from morale bonuses on such saves. When affected by a fear effect, their base speed increases by 10 feet and they gain a +1 dodge bonus to Armor Class. This racial trait replaces fearless and halfling luck."
        },
        {
           "name":"Fleet of Foot",
           "desc":"Some halflings are quicker than their kin but less cautious. Halflings with this racial trait move at normal speed and have a base speed of 30 feet. This racial trait replaces slow speed and sure-footed."
        },
        {"Halfling Jinx": "Halflings with this racial trait gain the ability to curse another creature with bad luck at will as a standard action. This curse has a range of 30 feet, and you must be able to see the target and have line of effect to it. The target gets a Will saving throw to resist this jinx (DC = 10 + 1/2 your level + your Charisma modifier). If your target makes this saving throw, it is immune to your jinx ability for 24 hours. A jinxed creature takes a –1 penalty on all saving throws. This jinx lasts for 24 hours or until you attempt to use your jinx again. A jinx is a supernatural ability, is not mind-affecting, does not allow spell resistance, and can affect any kind of creature not immune to luck effects. This replaces halfling luck."},
        {
           "name":"Ingratiating",
           "desc":"Halflings often survive at the whims of larger, more aggressive races. Because of this, they go out of their way to make themselves more useful, or at least entertaining, to larger folk. Halflings with this racial trait gain a +2 bonus on skill checks for a single Perform skill of their choice, and Perform is always a class skill for them. They also gain a +2 bonus on Craft and Profession checks. This racial trait replaces keen senses and sure-footed."
        },
        {
           "name":"Low Blow",
           "desc":"Some halflings train extensively in the art of attacking larger creatures. Halflings with this racial trait gain a +1 bonus on critical confirmation rolls against opponents larger than themselves. This racial trait replaces keen senses."
        },
        {
           "name":"Outrider",
           "desc":"Some halflings specialize in mounted combat. Halflings with this racial trait gain a +2 bonus on Handle Animal and Ride checks. This racial trait replaces sure-footed."
        },
        {
           "name":"Polyglot",
           "desc":"Some halflings, especially those who spend a lot of time traveling, develop a talent for learning new languages. These halflings gain a +2 racial bonus on Linguistics checks, and it is always a class skill for them. Halflings with this racial trait also begin play with the ability to speak Common, Halfling, and any one other language of their choice (except for secret languages, such as Druidic) in addition to bonus languages due to high Intelligence. They still gain the normal list of halfling bonus languages. This racial trait replaces keen senses and alters the halfling language racial trait."
        },
        {
           "name":"Practicality",
           "desc":"Halflings value hard work and common sense. Halflings with this racial trait gain a +2 bonus on any one Craft or Profession skill, as well as on Sense Motive checks and saves against illusions. This racial trait replaces fearless and sure-footed."
        },
        {
           "name":"Shiftless",
           "desc":"Halflings have a reputation for larceny and guile—and sometimes it's well deserved. Halflings with this racial trait gain a +2 racial bonus on Bluff and Sleight of Hand checks, and Sleight of Hand is always a class skill for them. This racial trait replaces sure-footed."
        },
        {
           "name":"Swift",
           "desc":"as Shadows Halflings possess incredible stealth even while moving through obstructed areas. Halflings with this racial trait reduce the penalty for using Stealth while moving by 5, and reduce the Stealth check penalty for sniping by 10. This racial trait replaces sure-footed."
        },
        {
           "name":"Underfoot",
           "desc":"Halflings must train hard to effectively fight bigger opponents. Halflings with this racial trait gain a +1 dodge bonus to AC against foes larger than themselves and a +1 bonus on Reflex saving throws to avoid trample attacks. This racial trait replaces halfling luck."
        },
        {
           "name":"Wanderlust",
           "desc":"Halflings love travel and maps. Halflings with this racial trait receive a +2 bonus on Knowledge (geography) and Survival checks. When casting spells or using abilities that provide or enhance movement, halflings treat their caster level as +1 higher than normal. This racial trait replaces fearless and halfling luck."
        },
        {
           "name":"Warslinger",
           "desc":"Halflings are experts at the use of the sling. Halflings with this racial trait can reload a sling as a free action. Reloading a sling still requires two hands and provokes attacks of opportunity. This racial trait replaces sure-footed."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add one extract formula from the alchemist's list to the alchemist's formula book. This formula must be at least one level below the highest formula level the alchemist can create."},
        {"Arcanist": "Gain 1/6 of a new arcanist exploit."},
        {"Barbarian": "Add a +1/2 bonus to trap sense or +1/3 to the bonus from the surprise accuracy rage power."},
        {"Bard": "Add +1/2 on Bluff checks to pass secret messages, +1/2 on Diplomacy checks to gather information, and +1/2 on Disguise checks to appear as an elven, half-elven, or human child."},
        {"Bloodrager": "Gain a +1/4 dodge bonus to AC while bloodraging against creatures at least one size category larger than the bloodrager."},
        {"Brawler": "Gain a +1 bonus to the brawler's CMD when resisting a grapple or overrun combat maneuver."},
        {"Cavalier": "Add +1/2 to the cavalier's effective class level for the purposes of determining the damage he deals when making an attack of opportunity against a challenged foe."},
        {"Cleric": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power."},
        {"Druid": "Add a +1/4 luck bonus on the saving throws of the druid's animal companion."},
        {"Fighter": "Add +1 to the Fighter's CMD when resisting a trip or grapple attempt."},
        {"Gunslinger": "Add +1/4 to the dodge bonus to AC granted by the nimble class feature (maximum +2) or +1/4 to the AC bonus gained when using the gunslinger's dodge deed."},
        {"Hunter": "The hunter's animal companion gains a +1/4 luck bonus on saving throws. If the hunter replaces her animal companion, the new animal companion gains this bonus."},
        {"Inquisitor": "Add +1/4 to the number of times per day that an inquisitor can change her most recent teamwork feat."},
        {"Investigator": "Add one extract formula from the investigator's list to his formula book. This formula must be at least 1 formula level below the highest level the investigator can create."},
        {"Magus": "The magus gains 1/6 of a new magus arcana."},
        {"Monk": "Add +1 to the monk's CMD when resisting a grapple and +1/2 to the number of stunning attacks he can attempt per day."},
        {"Oracle": "Add +1/2 to the oracle's level for the purpose of determining the effects of the oracle's curse ability."},
        {"Paladin": "Add +1/2 hit point to the paladin's lay on hands ability (whether using it to heal or harm)."},
        {"Ranger": "Add a +1/4 dodge bonus to Armor Class against the ranger's favored enemies."},
        {"Rogue": "Choose a weapon from the following list: sling, dagger, or any weapon with “halfling” in its name. Add a +1/2 bonus on critical hit confirmation rolls with that weapon (maximum bonus +4). This bonus does not stack with Critical Focus."},
        {"Shaman": "Add 1/2 to the shaman's effective class level for the purpose of determining her spirit animal's natural armor adjustment, Intelligence, and special abilities."},
        {"Skald": "Choose a weapon from the following list: dagger, sling, or any weapon with the word 'halfling' in its name. Add a +1/2 bonus on critical hit confirmation rolls with that weapon (maximum bonus +4). This bonus doesn't stack with those gained through Critical Focus and similar effects."},
        {"Slayer": "Add a +1/4 dodge bonus to Armor Class against the slayer's studied target."},
        {"Sorcerer": "Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power."},
        {"Summoner": "Add +1 skill rank to the summoner's eidolon."},
        {"Swashbuckler": "Increase the number of times the swashbuckler can use charmed life by 1/4."},
        {"Warpriest": "Add 1/4 to the warpriest's effective level when determining the damage of his sacred weapon."},
        {"Witch": "Add +1/4 to the witch's caster level when determining the effects of the spells granted to her by her patron."},
        {"Wizard": "Add +1/2 to the wizard's effective class level for the purposes of determining his familiar's natural armor adjustment, Intelligence, and special abilities."}
    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Adaptive Fortune",
        "Blundering Defense",
        "Cautious Fighter",
        "Childlike",
        "Courageous Resolve",
        "Desperate Swing",
        "Fortunate One",
        "Halfling Slinger",
        "Improved Low Blow",
        "Lucky Halfling",
        "Lucky Healer",
        "Lucky Strike",
        "Pass for Human",
        "Risky Striker",
        "Sure and Fleet",
        "Surprise Strike",
        "Uncanny Defense",
        "Well-Prepared"
    ],
    "racialprestigeclasses": ["Halfling Opportunist"]
  },























  { "name": "Half-Orc",
    "names": {
        "male": ["Ausk", "Davor", "Hakak", "Kizziar", "Makoa", "Nesteruk", "Tsadok" ],
        "female": ["Canan", "Drogheda", "Goruza", "Mazon", "Shirish", "Tevaga", "Zeljka" ]
    },
    "age":{
       "adulthood": 14,
       "intuitive": "+1d4",
       "selftaught": "+1d6",
       "trained": "+2d6"
    },
    "height":{
        "malebase": 58,
        "malemod": "+2d12",
        "femalebase": 53,
        "femalemod": "+2d12"
    },
    "weight":{
        "malebase": 150,
        "malemod": "+2d12*7",
        "femalebase": 110,
        "femalemod": "+2d12*7"
    },

    "ability":[{"any":2}],
    "size": "Medium Humanoid (human, orc)",
    "speed": "30ft",
    "languages": ["Common", "Orc"],
    "intlanguages": ["Abyssal", "Draconic", "Giant", "Gnoll", "Goblin"],
    "traits": [
        {
           "name":"Intimidating",
           "desc":"Half-orcs receive a +2 racial bonus on Intimidate checks due to their fearsome nature."
        },
        {
           "name":"Orc Ferocity",
           "desc":"Once per day, when a half-orc is brought below 0 hit points but not killed, he can fight on for 1 more round as if disabled. At the end of his next turn, unless brought to above 0 hit points, he immediately falls unconscious and begins dying."
        },
        {
           "name":"Weapon Familiarity",
           "desc":"Half-orcs are proficient with greataxes and falchions and treat any weapon with the word “orc” in its name as a martial weapon."
        },
        {
           "name":"Darkvision",
           "desc":"Half-orcs can see in the dark up to 60 feet."
        },
        {
           "name":"Orc Blood",
           "desc":"Half-orcs count as both humans and orcs for any effect related to race."
        }
    ],
    "alternatetraits": [
        {
           "name":"Acute Darkvision",
           "desc":"Some half-orcs have exceptionally sharp darkvision, gaining darkvision 90 feet. This racial trait replaces orc ferocity and darkvision."
        },
        {
           "name":"Beastmaster",
           "desc":"Some half-orcs have a spiritual kinship with fantastical beasts, capturing them for sport or living and hunting with them. A half-orc with this trait treats whips and nets as martial weapons and gains a +2 racial bonus on Handle Animal checks. This racial trait replaces orc ferocity."
        },
        {
           "name":"Bestial",
           "desc":"The orc blood of some half-orcs manifests in the form of particularly prominent orc features, exacerbating their bestial appearances but improving their already keen senses. They gain a +2 racial bonus on Perception checks. This racial trait replaces orc ferocity."
        },
        {
           "name":"Burning Assurance",
           "desc":"(from the Desert) [BOG] Half-orcs from desert terrain lack the chip on their shoulder that many others of their kind acquire as a result of prejudice, and their self-confidence puts others at ease. Desert half-orcs with this racial trait gain a +2 racial bonus on Diplomacy checks. This racial trait replaces the intimidating racial trait."
        },
        {
           "name":"Cavewight",
           "desc":"Some half-orcs live far below the surface, seeking freedom in winding cave complexes. Half-orcs with this racial trait gain a +1 racial bonus on Knowledge (dungeoneering) and Survival checks made underground. This racial trait replaces the intimidating racial trait."
        },
        {
           "name":"Chain Fighter",
           "desc":"Some half-orcs have escaped from slavery and reforged the chains of their imprisonment into deadly weapons. Half-orcs with this racial trait are proficient with flails and heavy flails, and treat dire flails and spiked chains as martial weapons. This racial trait replaces weapon familiarity."
        },
        {
           "name":"City-Raised",
           "desc":"Half-orcs with this trait know little of their orc ancestry and were raised among humans and other half-orcs in a large city. City-raised half-orcs are proficient with whips and longswords, and receive a +2 racial bonus on Knowledge (local) checks. This racial trait replaces weapon familiarity."
        },
        {
           "name":"Cliffside Charger",
           "desc":"(from the Mountains) [BOG] Half-orcs from mountainous terrain are accustomed to traveling in the steep terrain of their mountain homes. When in mountain terrain, mountain half-orcs with this racial trait can move through natural difficult terrain at their normal speed; magically altered terrain affects them normally. In addition, cragkin gain a +10 foot racial bonus to their speed while charging. This racial trait replaces the orc ferocity and weapon familiarity racial traits."
        },
        {
           "name":"Evader",
           "desc":"(from the Underdark) [BOG] Having lived all your life at the mercy of savage underworld creatures, you've developed a knack for finding your way about silently in the dark. You gain a +5 racial bonus on Survival checks to avoid becoming lost, and a +1 racial bonus on Stealth checks. This racial trait replaces the intimidating racial trait."
        },
        {
           "name":"Forest Walker",
           "desc":"More at home in the forests and jungles of the world, these half-orcs are well adapted to their surroundings. Half-orcs with this trait have low-light vision and gain a +2 racial bonus on Climb checks. This racial trait replaces darkvision."
        },
        {
           "name":"Gatecrasher",
           "desc":"Many half-orcs revel in acts of wanton destruction. Half-orcs with this racial trait gain a +2 racial bonus on Strength checks to break objects and on sunder combat maneuver checks. This racial trait replaces orc ferocity."
        },
        {
           "name":"Rock Climber",
           "desc":"Half-orcs from mountainous regions are excellent climbers, and sometimes ambush prey by leaping down from above. Half-orcs with this racial trait gain a +1 racial bonus on Acrobatics and Climb checks. This racial trait replaces the intimidating trait."
        },
        {
           "name":"Sacred Tattoo",
           "desc":"Many half-orcs decorate themselves with tattoos, piercings, and ritual scarification, which they consider sacred markings. Half-orcs with this racial trait gain a +1 luck bonus on all saving throws. This racial trait replaces orc ferocity."
        },
        {
           "name":"Scavenger",
           "desc":"Some half-orcs eke out a leaving picking over the garbage heaps of society, and must learn to separate rare finds from the inevitable dross. Half-orcs with this racial trait receive a +2 racial bonus on Appraise checks and on Perception checks to find hidden objects (including traps and secret doors), determine whether food is spoiled, or identify a potion by taste. This racial trait replaces the intimidating trait."
        },
        {
           "name":"Shaman's Apprentice",
           "desc":"Only the most stalwart survive the years of harsh treatment that an apprenticeship to an orc shaman entails. Half-orcs with this trait gain Endurance as a bonus feat. This racial trait replaces the intimidating trait."
        },
        {
           "name":"Skilled",
           "desc":"Second- and third-generation half-orcs often favor their human heritage more than their orc heritage. Half-orcs with this trait gain 1 additional skill rank per level. This racial trait replaces darkvision."
        },
        {
           "name":"Squalid",
           "desc":"Some half-orcs exist in surroundings so filthy and pestilent that even orcs would have difficulty living in them. Halforcs with this racial trait gain a +2 racial bonus on saving throws made to resist nausea, the sickened condition, and disease. This racial trait replaces orc ferocity."
        },
        {
           "name":"Toothy",
           "desc":"Some half-orcs' tusks are large and sharp, granting a bite attack. This is a primary natural attack that deals 1d4 points of piercing damage. This racial trait replaces orc ferocity."
        },
        {
           "name":"Unflinching Valor",
           "desc":"(from cold regions) [BOG] Many fearsome arctic predators consider young frostkin easy prey, but some frostkin manage to surpass their fear and fight off these beasts in time for help to arrive. Winter half-orcs with this racial trait gain a +2 racial bonus on saving throws against fear effects, and a +1 racial bonus to CMD to avoid being grappled. This racial trait replaces the intimidating racial trait."
        },
        {
           "name":"Warded Skin",
           "desc":"(from the Jungle) [BOG] Half-orcs from jungles are often protected by elaborate tattoos that redirect demonic magic. Jungle half-orcs with this racial trait gain spell resistance against divine magic equal to 6 + their level. Additionally, divine spells cast on them by demon worshipers have a 10% chance of failure. This racial trait replaces the orc ferocity racial trait."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add +1/2 to the alchemist's bomb damage."},
        {"Arcanist": "Gain a +1 bonus on concentration checks made due to taking damage while casting arcanist spells."},
        {"Barbarian": "Add +1 to the barbarian's total number of rage rounds per day."},
        {"Bard": "Add +1 to the bard's total number of bardic performance rounds per day."},
        {"Bloodrager": "Increase the bloodrager's total number of bloodrage rounds per day by 1."},
        {"Brawler": "Add 1/4 to the brawler's effective level to determine her unarmed strike damage."},
        {"Hunter": "Add 1 hit point to the hunter's animal companion. If the hunter replaces his animal companion, the new animal companion gains these bonus hit points."},
        {"Cavalier": "Add +1 hit point to the cavalier's mount companion. If the cavalier ever replaces his mount, the new mount gains these bonus hit points."},
        {"Cleric": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power."},
        {"Druid": "Add +1/3 to the druid's natural armor bonus when using wild shape."},
        {"Fighter": "Add a +2 bonus on rolls to stabilize when dying."},
        {"Gunslinger": "Add a +1/3 bonus on attack rolls when using the pistol whip deed."},
        {"Hunter": "Add 1 hit point to the hunter's animal companion. If the hunter replaces his animal companion, the new animal companion gains these bonus hit points."},
        {"Inquisitor": "Add a +1/2 bonus on Intimidate checks and Knowledge checks to identify creatures."},
        {"Investigator": "Gain a +1/3 bonus on critical hit confirmation rolls made while using studied combat (maximum bonus of +5). This bonus does not stack with those gained through Critical Focus and similar effects."},
        {"Magus": "Add +1/2 point of fire damage to spells that deal fire damage cast by the magus."},
        {"Monk": "Add +1 to the monk's CMD when resisting a grapple and +1/2 to the number of stunning attacks he can attempt per day."},
        {"Oracle": "Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast."},
        {"Paladin": "Add +1/3 on critical hit confirmation rolls made while using smite evil (maximum bonus of +5). This bonus does not stack with Critical Focus."},
        {"Ranger": "Add +1 hit point to the ranger's animal companion. If the ranger ever replaces his animal companion, the new animal companion gains these bonus hit points."},
        {"Rogue": "Add +1/3 on critical hit confirmation rolls made while using sneak attack (maximum bonus of +5). This bonus does not stack with Critical Focus."},
        {"Shaman": "Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast."},
        {"Skald": "Increase the skald's total number of raging song rounds per day by 1."},
        {"Slayer": "Gain a +1/3 bonus on critical hit confirmation rolls made while using sneak attack (maximum bonus of +5). This bonus doesn't stack with those gained through Critical Focus and similar effects."},
        {"Sorcerer": "Add +1/2 point of fire damage to spells that deal fire damage cast by the sorcerer."},
        {"Summoner": "Add +1 hit point to the summoner's eidolon."},
        {"Swashbuckler": "Gain a +1/3 bonus on all critical hit confirmation rolls made while using the precise strike deed (maximum bonus of +5). This bonus doesn't stack with those gained through Critical Focus and similar effects."},
        {"Warpriest": "Gain a +2 bonus on rolls to stabilize when dying."},
        {"Witch": "Add +1 skill rank to the witch's familiar. If the half-orc ever replaces her familiar, the new familiar gains these bonus skill ranks."},
        {"Wizard": "Add a +1 bonus on concentration checks made due to taking damage while casting wizard spells."}
    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Beast Rider",
        "Blood Vengeance",
        "Brutal Grappler",
        "Deathless Initiate",
        "Deathless Master",
        "Deathless Zealot",
        "Destroyer's Blessing",
        "Ferocious Resolve",
        "Ferocious Summons",
        "Ferocious Tenacity",
        "Fight On",
        "Fire God's Blessing",
        "Gore Fiend",
        "Horde Charge",
        "Ironguts",
        "Ironhide",
        "Keen Scent",
        "Pass for Human",
        "Razortusk",
        "Resilient Brute",
        "Smash",
        "Smell Fear",
        "Surprise Follow-Through",
        "Surprise Follow-Through, Improved",
        "Sympathetic Rage",
        "Tenacious Survivor",
        "Thrill of the Kill",
        "War Singer"
    ],
    "racialprestigeclasses": []
  },


























  { "name": "Human",
    "names": {
        "male": ["Alerdene", "Alinza", "Aula", "Bach Hien", "Belka", "Beshkee", "Chammady", "Chao", "Do Quyen", "Eshe", "Eudomia", "Gerda", "Hiriko", "Ilinica", "Indah", "Ingirt", "Izora", "Jalket", "Jayazi", "Kaede", "Kalizama", "Kamshi", "Lestari", "Leyli", "Marisan", "Me'amesa", "Meilin", "Mirelinda", "Mpaandi", "Nalmida", "Nanya", "Narantuyaa", "Ntisi", "Pasara", "Pontia", "Que Xuan", "Revhi", "Runa", "Sahba", "Shirin", "Shivkah", "Sinkitah", "Surenchinua", "Udara", "Umie", "Valki", "Waajida", "Xemne", "Xue", "Zalika", "Zova" ],
        "female": ["Aakif", "Andrezi", "Arasmes", "Bahram", "Baolo", "Barid", "Batsaikhan", "Belor", "Budi", "Darvan", "Dolok", "Eilif", "Garidan", "Gellius", "Hadzi", "Hamengku", "Harisko", "Iacobus", "Jaali", "Jianguo", "Kjell", "Kousei", "Kronug", "Menas", "Mitabu", "Narsius", "Nonek", "Pateba", "Pratavh", "Qorchi", "Ragnar", "Rubani", "Seckor", "Shokamb", "Shuo", "Sunaki", "Suryo", "Tabansi", "Teruawa", "Thanh Liem", "Toan Hao", "Tomorbataar", "Tuong Kinh", "Ursion", "Vachedi", "Viorec", "Yekskya", "Zaiho", "Zhen" ]
    },
    "age":{
       "adulthood": 15,
       "intuitive": "+1d4",
       "selftaught": "+1d6",
       "trained": "+2d6"
    },
    "height":{
        "malebase": 58,
        "malemod": "+2d10",
        "femalebase": 53,
        "femalemod": "+2d10"
    },
    "weight":{
        "malebase": 120,
        "malemod": "+2d10*5",
        "femalebase": 85,
        "femalemod": "+2d10*5"
    },

    "ability":[{"any":2}],
    "size": "Medium Humanoid (human)",
    "speed": "30ft",
    "languages": ["Common"],
    "intlanguages": ["any"],
    "traits": [
        {
           "name":"Bonus Feat",
           "desc":"Humans select one extra feat at 1st level."
        },
        {
           "name":"Skilled",
           "desc":"Humans gain an additional skill rank at first level and one additional rank whenever they gain a level."
        }
    ],
    "alternatetraits": [
        {
           "name":"Adoptive Parentage",
           "desc":"Humans are sometimes orphaned and adopted by other races. Choose one humanoid race without the human subtype. You start play with that race's languages and gain that race's weapon familiarity racial trait (if any). If the race does not have weapon familiarity, you gain either Skill Focus or Weapon Focus as a bonus feat that is appropriate for that race instead. This racial trait replaces the bonus feat trait."
        },
        {
           "name":"Dual Talent",
           "desc":"Some humans are uniquely skilled at maximizing their natural gifts. These humans pick two ability scores and gain a +2 racial bonus in each of those scores. This racial trait replaces the +2 bonus to any one ability score, the bonus feat, and the skilled traits."
        },
        {
           "name":"Eye for Talent",
           "desc":"Humans have great intuition for hidden potential. They gain a +2 racial bonus on Sense Motive checks. In addition, when they acquire an animal companion, bonded mount, cohort, or familiar, that creature gains a +2 bonus to one ability score of the character's choice. This racial trait replaces the bonus feat trait."
        },
        {
           "name":"Focused Study",
           "desc":"All humans are skillful, but some, rather than being generalists, tend to specialize in a handful of skills. At 1st, 8th, and 16th level, such humans gain Skill Focus in a skill of their choice as a bonus feat. This racial trait replaces the bonus feat trait."
        },
        {
           "name":"Heart of the Fields",
           "desc":"Humans born in rural areas are used to hard labor. They gain a racial bonus equal to half their character level to any one Craft or Profession skill, and once per day they may ignore an effect that would cause them to become fatigued or exhausted. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Mountains",
           "desc":"Humans born in the mountains are skilled at negotiating heights and precipices. They gain a +2 racial bonus on Climb checks and Acrobatics checks to move on narrow surfaces and uneven ground. Furthermore, they are considered acclimated to the effects of high altitude. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Sea",
           "desc":"Humans born near the sea are always drawn to it. They gain a +2 racial bonus on Profession (sailor) and Swim checks, and these are always class skills for them. They can hold their breath twice as long as normal, and spellcasters gain a +4 racial bonus on concentration checks when attempting to cast spells underwater. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Slums",
           "desc":"Humans who eke out a life in a city's teeming slums must be quick and clever. They gain a +2 racial bonus on Sleight of Hand and Stealth checks, and a +4 racial bonus on Survival checks in urban and underground settings. In addition, they may roll twice when saving against disease, taking the better roll. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Snows",
           "desc":"Humans born in chilly climes treat cold climates as one category less severe. They gain a +2 racial bonus on Fortitude saving throws against the effects of cold climates, on any check or saving throw to avoid slipping and falling, and to CMD against trip combat maneuvers. This bonus applies on Acrobatics and Climb checks made in slippery conditions. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Streets",
           "desc":"Humans from bustling cities are skilled with crowds. They gain a +1 racial bonus on Reflex saves and a +1 dodge bonus to Armor Class when adjacent to at least two other allies. Crowds do not count as difficult terrain for them. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Sun",
           "desc":"Humans born in tropical climates treat hot climates as one category less severe. They also gain a +2 racial bonus on Fortitude saving throws against the effects of a hot climate, as well as against the poison and distraction ability of swarms and vermin. This racial trait replaces skilled."
        },
        {
           "name":"Heart of the Wilderness",
           "desc":"Humans raised in the wild learn the hard way that only the strong survive. They gain a racial bonus equal to half their character level on Survival checks. They also gain a +5 racial bonus on Constitution checks to stabilize when dying and add half their character level to their Constitution score when determining the negative hit point total necessary to kill them. This racial trait replaces skilled."
        },
        {
           "name":"Heroic",
           "desc":"Some humans are born heroes. In campaigns that use the optional hero point system, each time these humans gain a level, they gain 2 hero points instead of 1. If they take the Blood of Heroes feat, they gain 3 hero points each level instead of 2. This racial trait replaces the bonus feat trait."
        },
        {
           "name":"Mixed Heritage",
           "desc":"Often human civilization is defined by more than one characteristic. A human with this trait may select a second “Heart of the” racial trait. This replaces the bonus feat racial trait."
        },
        {
           "name":"Silver Tongued",
           "desc":"Human are often adept at subtle manipulation and putting even sworn foes at ease. Humans with this trait gain a +2 bonus on Diplomacy and Bluff checks. In addition, when they use Diplomacy to shift a creature's attitude, they can shift up to three steps up rather than just two. This racial trait replaces skilled."
        }
    ],
    "favoredclassoptions": [
        {"Alchemist": "Add one extract formula from the alchemist formula list to the character's formula book. This formula must be at least one level below the highest formula level the alchemist can create."},
        {"Arcanist": "Add one spell from the arcanist spell list to the arcanist's spellbook. The spell must be at least 1 spell level below the highest level the arcanist can cast."},
        {"Barbarian": "Add a +1/2 bonus to trap sense or +1/3 to the bonus from the superstitious rage power."},
        {"Bard": "Add one spell known from the bard spell list. This spell must be at least one level below the highest spell level the bard can cast."},
        {"Bloodrager": "Increase the bloodrager's total number of bloodrage rounds per day by 1."},
        {"Brawler": "Gain a +1 bonus to the brawler's CMD when resisting two combat maneuvers of the brawler's choice."},
        {"Cavalier": "Add +1/4 to the cavalier's banner bonus."},
        {"Cleric": "Add a +1 bonus on caster level checks made to overcome the spell resistance of outsiders."},
        {"Druid": "Add a +1/2 bonus on Diplomacy and Intimidate checks to change a creature's attitude."},
        {"Fighter": "Add +1 to the Fighter's CMD when resisting two combat maneuvers of the character's choice."},
        {"Gunslinger": "Add +1/4 point to the gunslinger's grit points."},
        {"Hunter": "Add 1 skill rank to the hunter's animal companion. If the hunter replaces his animal companion, the new animal companion gains these bonus skill ranks."},
        {"Inquisitor": "Add one spell known from the inquisitor spell list. This spell must be at least one level below the highest spell level the inquisitor can cast."},
        {"Investigator": "Add one extract formula from the investigator's formula list to his formula book. This formula must be at least 1 formula level below the highest level the investigator can create."},
        {"Magus": "Add +1/4 point to the magus' arcane pool."},
        {"Monk": "Add +1/4 point to the monk's ki pool."},
        {"Oracle": "Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast."},
        {"Paladin": "Add +1 to the paladin's energy resistance to one kind of energy (maximum +10)."},
        {"Ranger": "Add +1 hit point or +1 skill rank to the ranger's animal companion. If the ranger ever replaces his companion, the new companion gains these bonus hit points or skill ranks."},
        {"Rogue": "The rogue gains +1/6 of a new rogue talent."},
        {"Shaman": "Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast."},
        {"Skald": "Add one spell from the skald's spell list to the skald's known spells. This spell must be at least 1 spell level below the highest level the skald can cast."},
        {"Slayer": "Gain 1/6 of a new slayer talent."},
        {"Sorcerer": "Add one spell known from the sorcerer spell list. This spell must be at least one level below the highest spell level the sorcerer can cast."},
        {"Summoner": "Add +1 hit point or +1 skill rank to the summoner's eidolon."},
        {"Swashbuckler": "Increase the total number of points in the swashbuckler's panache pool by 1/4."},
        {"Warpriest": "Gain 1/6 of a new bonus combat feat."},
        {"Witch": "Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells."},
        {"Wizard": "Add one spell from the wizard spell list to the wizard's spellbook. This spell must be at least one level below the highest spell level the wizard can cast."}
    ],
    "bonusfeats": [],
    "spelllikeabilities": [],
    "racialfeats":[
        "Bestow Luck",
        "Critical Versatility",
        "Dauntless Destiny",
        "Defiant Luck",
        "Eclectic",
        "Fast Learner",
        "Fearless Curiosity",
        "Heroic Will",
        "Huntmaster",
        "Improved Improvisation",
        "Improvisation",
        "Inexplicable Luck",
        "Intimidating Confidence",
        "Martial Mastery",
        "Martial Versatility",
        "Racial Heritage",
        "Surge of Success"
    ],
    "racialprestigeclasses": []
  }
]}
