{"races": [
  {"name": "Dwarf",
   "ability":[{"con":2}, {"wis":2}, {"cha":-2}],
   "size": "Medium Humanoid (dwarf)",
   "speed": "20ft",
   "languages": ["Common", "Dwarven"],
   "traits": [
    {"Defensive Training": "Dwarves gain a +4 dodge bonus to AC against monsters of the giant subtype."},
    {"Hardy": "Dwarves gain a +2 racial bonus on saving throws against poison, spells, and spell-like abilities."},
    {"Stability": "Dwarves gain a +4 racial bonus to their Combat Maneuver Defense when resisting a bull rush or trip attempt while standing on the ground."},
    {"Greed": "Dwarves gain a +2 racial bonus on Appraise checks made to determine the price of non-magical goods that contain precious metals or gemstones."},
    {"Stonecunning": "Dwarves gain a +2 bonus on Perception checks to notice unusual stonework, such as traps and hidden doors located in stone walls or floors. They receive a check to notice such features whenever they pass within 10 feet of them, whether or not they are actively looking."},
    {"Darkvision": "Dwarves can see perfectly in the dark up to 60 feet."},
    {"Hatred": "Dwarves gain a +1 racial bonus on attack rolls against humanoid creatures of the orc and goblinoid subtypes because of their special training against these hated foes."},
    {"Weapon Familiarity": "Dwarves are proficient with battleaxes, heavy picks, and warhammers, and treat any weapon with the word “dwarven” in its name as a martial weapon."}
],
   "alternatetraits": [
    {"Ancient Enmity": "Dwarves have long been in conflict with elves, especially the hated drow. Dwarves with this racial trait receive a +1 racial bonus on attack rolls against humanoid creatures of the elf subtype. This racial trait replaces hatred."},
    {"Craftsman": "Dwarves are known for their superior craftsmanship when it comes to metallurgy and stonework. Dwarves with this racial trait receive a +2 racial bonus on all Craft or Profession checks related to metal or stone. This racial trait replaces greed."},
    {"Deep Warrior": "Dwarves with this racial trait grew up facing the abominations that live deep beneath the surface. They receive a +2 dodge bonus to AC against monsters of the aberration type and a +2 racial bonus on combat maneuver checks made to grapple such creatures (or to continue a grapple). This racial trait replaces defensive training."},
    {"Giant Hunter": "Dwarves with this racial trait gain a +1 bonus on attack rolls against humanoids with the giant subtype. Furthermore, they gain a +2 bonus on Survival checks to find and follow tracks made by humanoids with the giant subtype. This racial trait replaces hatred."},
    {"Lorekeeper": "Dwarves keep extensive records about their history and the world around them. Dwarves with this racial trait receive a +2 racial bonus on Knowledge (history) checks that pertain to dwarves or their enemies. They can make such skill checks untrained. This racial trait replaces greed."},
    {"Magic Resistant": "Some of the older dwarven clans are particularly resistant to magic. Dwarves with this racial trait gain spell resistance equal to 5 + their character level. This resistance can be lowered for 1 round as a standard action. Dwarves with this racial trait take a –2 penalty on all concentration checks made in relation to arcane spells. This racial trait replaces hardy."},
    {"Minesight": "Dwarves with this racial trait increase the range of their darkvision to 90 feet; however, they are automatically dazzled in bright light and take a –2 penalty on saving throws against effects with the light descriptor. This racial trait replaces darkvision."},
    {"Mountaineer": "Mountain dwarves are skilled at climbing and navigating narrow ledges. Dwarves with this racial trait are immune to altitude sickness and do not lose their Dexterity bonus to AC when making Climb or Acrobatics checks to cross narrow or slippery surfaces. This racial trait replaces stability."},
    {"Relentless": "Dwarves are skilled at pushing their way through a battlefield, tossing aside lesser foes with ease. Dwarves with this racial trait receive a +2 bonus on combat maneuver checks made to bull rush or overrun an opponent. This bonus only applies while both the dwarf and his opponent are standing on the ground. This racial trait replaces stability."},
    {"Rock Stepper": "Dwarves with this racial trait can skillfully negotiate rocky terrain. They can ignore difficult terrain created by rubble, broken ground, or steep stairs when they take a 5-foot step. This racial trait replaces stonecunning."},
    {"Saltbeard": "Dwarves occasionally found iron cities along rugged seacoasts, and natives of such cities gain a +2 bonus on Profession (sailor) and Survival checks while at sea. They gain a +1 racial bonus on attack rolls and a +2 dodge bonus to AC against creatures with the aquatic or water subtype. Their greed racial trait applies only to treasure found in or under the water, but applies to all such treasure regardless of whether or not it contains metal or gemstones. This racial trait replaces defensive training, hatred, and stonecunning."},
    {"Sky Sentinel": "As creatures with a deep affinity for the ground, dwarves are wary of attacks from above. Enemies on higher ground gain no attack roll bonus against dwarves with this racial trait, and they gain a +1 racial bonus on attack rolls, a +2 dodge bonus to AC, and a +2 bonus on Perception checks against flying creatures. This racial trait replaces defensive training, hatred, and stonecunning."},
    {"Stonesinger": "Some dwarves' affinity for the earth grants them greater powers. Dwarves with this racial trait are treated as one level higher when casting spells with the earth descriptor or using granted powers of the Earth domain, the bloodline powers of the earth elemental bloodline, and revelations of the oracle's stone mystery. This ability does not give them early access to level-based powers; it only affects the powers they could use without this ability. This racial trait replaces stonecunning."},
    {"Stubborn": "Dwarves are renowned for their stubbornness. Dwarves with this racial trait receive a +2 racial bonus on Will saves to resist spells and spell-like abilities of the enchantment (charm) and enchantment (compulsion) schools. In addition, if they fail such a save, they receive another save 1 round later to prematurely end the effect (assuming it has a duration greater than 1 round). This second save is made at the same DC as the first. If the dwarf has a similar ability from another source (such as a rogue's slippery mind), he can only use one of these abilities per round, but he can try the other on the second round if the first reroll ability fails. This racial trait replaces hardy."},
    {"Surface Survivalist": "Some dwarves have dwelt so long above ground they have lost their ability to see at night. However, their adaptation to extreme environments allows them to treat wind conditions (when determining whether or not they are checked or blown away) and either hot or cold climates (choose one) as one step less severe. This racial trait replaces darkvision."},
    {"Xenophobic": "Isolationist dwarves despise non-dwarven humanoids. They speak only Dwarven and do not gain any bonus languages from possessing a high Intelligence score. In addition, they learn only one language per 2 ranks of Linguistics they possess. However, their untrusting nature gives them a +1 bonus against mind-affecting effects, except for fear affects. This racial trait replaces a dwarf's normal languages."},
    {"Wyrmscourged": "Dwarves with this racial trait gain a +1 bonus on attack rolls and a +2 dodge bonus to AC and on saving throws against the extraordinary, supernatural, and spell-like abilities of dragons. They also gain a +2 racial bonus on Knowledge (arcana) checks to identify dragons and can make such checks untrained. This racial trait replaces defensive training, hatred, and stonecunning."}
],
   "favoredclassoptions": [
    {"Alchemist": "Add +1/4 to the alchemist's natural armor bonus when using his mutagen."},
    {"Arcanist": "Add +1/4 to the arcanist's effective class level when determining the effects of the arcane barrier and arcane weapon arcanist exploits. Source Advanced Class Guide"},
    {"Barbarian": "Add +1 to the barbarian's total number of rage rounds per day."},
    {"Bard": "Reduce arcane spell failure chance for casting bard spells when wearing medium armor by +1%. Once the total reaches 10%, the bard also receives Medium Armor Proficiency, if he does not already possess it."},
    {"Bloodrager": "Increase the bloodrager's total number of bloodrage rounds per day by 1. Source Advanced Class Guide"},
    {"Brawler": "Reduce the hardness of any object made from clay, stone, or metal by 1 whenever the object is struck by the brawler's unarmed strike (minimum 0). Source Advanced Class Guide"},
    {"Cavalier": "Add +1/2 to the cavalier's bonus to damage against targets of his challenge."},
    {"Cleric": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power."},
    {"Druid": "Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds +1/2 to the number of uses per day of that domain power."},
    {"Fighter": "Add +1 to the Fighter's CMD when resisting a bull rush or trip."},
    {"Gunslinger": "Reduce the misfire chance for one type of firearm by 1/4. You cannot reduce the misfire chance of a firearm below 1."},
    {"Hunter": "Gain a +1/2 bonus on wild empathy checks the hunter makes to influence animals and magical beasts that live underground. Source Advanced Class Guide"},
    {"Inquisitor": "Add +1/2 to the inquisitor's level for the purpose of determining the effects of one type of judgment."},
    {"Investigator": "Gain a +1/4 bonus on Perception checks when underground and +1/2 bonus to the investigator's trap sense ability regarding stone traps. Source Advanced Class Guide"},
    {"Magus": "Select one known magus arcana usable only once per day. The magus adds +1/6 to the number of times it can be used per day. Once that magus arcana is usable twice per day, the magus must select a different magus arcana."},
    {"Monk": "Reduce the Hardness of any object made of clay, stone, or metal by 1 whenever the object is struck by the monk's unarmed strike (minimum of 0)."},
    {"Oracle": "Reduce the penalty for not being proficient with one weapon by 1. When the nonproficiency penalty for a weapon becomes 0 because of this ability, the oracle is treated as having the appropriate Martial or Exotic Weapon Proficiency feat with that weapon."},
    {"Paladin": "Add a +1 bonus on concentration checks when casting paladin spells."},
    {"Ranger": "Add a +1/2 bonus on wild empathy checks to influence animals and magical beasts that live underground."},
    {"Rogue": "Add a +1/2 bonus on Disable Device checks regarding stone traps and a +1/2 bonus to trap sense regarding stone traps."},
    {"Shaman": "Add +1/4 to the natural armor bonus of the shaman's spirit animal. Source Advanced Class Guide"},
    {"Skald": "Reduce the arcane spell failure chance for casting skald spells when wearing heavy armor by 1%. Once the total reduction reaches 10%, the skald also receives Heavy Armor Proficiency (if the skald does not already possess it). Source Advanced Class Guide"},
    {"Slayer": "Gain a +1/3 bonus on Knowledge (dungeoneering) checks and on Survival checks when underground. If the slayer has a +1 bonus on Knowledge (dungeoneering) checks from this ability, he is also considered trained in that skill. Source Advanced Class Guide"},
    {"Sorcerer": "Add +1/2 to acid and earth spell or spell-like ability damage."},
    {"Summoner": "Add a +1/4 natural armor bonus to the AC of the summoner's eidolon."},
    {"Swashbuckler": "Add +1/4 to the swashbuckler's effective class level to determine the extra damage she deals because of the precise strike deed when wielding a light pick or a heavy pick. If the swashbuckler has the Slashing Grace feat or another similar effect, she can treat the battleaxe or handaxe as a one-handed piercing melee weapon, and she gains this benefit when wielding the appropriate weapon for the feat as well. Source Advanced Class Guide"},
    {"Warpriest": "Add +1/3 to the number of times per day the warpriest can use blessings, but he can only use these additional uses on blessings that affect weapons or armor. Source Advanced Class Guide"},
    {"Witch": "Add +1/4 natural armor bonus to the AC of the witch's familiar."},
    {"Wizard": "Select one item creation feat known by the wizard. Whenever he crafts an item using that feat, the amount of progress he makes in an 8-hour period increases by 200 gp (50 gp if crafting while adventuring). This does not reduce the cost of the item; it just increases the rate at which the item is crafted."}

],
   "skillbonuses": [{"Appraise":2}, {"Perception":2}],
   "bonusfeats": [],
   "spelllikeabilities": []
  }
]}
